<template>
  <div class="modal-overlay">
    <div class="modal-window" @click.stop>
      <div class="modal-content">
        <h2>Формулы расчета калорий</h2>
        <h3>Формула Харриса-Бенедикта:</h3>
        <p>Впервые о формуле Харриса-Бенедикта написали в 1919 году.
          Работа была опубликована Институтом Карнеги в Вашингтоне
          и называлась «Биометрические исследования основного обмена человека».</p>
        <p>Джеймс Артур Харрис и Фрэнсис Гано Бенедикт показали, что число калорий,
          необходимых человеку каждый день, изменяется от базального метаболизма (BMR) и активного метаболизма (AMR).</p>
        <p><b>Как определить BMR (базальный метаболизм):</b></p>
        <p>Базальный метаболизм BMR для женщин:
          BMR = 447,593 + (9,247 * вес в кг) + (3,098 * рост в см) - (4,330 * возраст в годах).</p>
        <p>Базальный метаболизм BMR для мужчин:
          BMR = 88,362 + (13,397 * вес в кг) + (4,799 * рост в см) - (5,677 * возраст в годах).</p>
        <p><b>Как определить AMR (активный метаболизм):</b></p>
        <p>В зависимости от того, какой у вас образ жизни, выбирается соответствующий коэффициент:</p>
        <ul>
          <li>Сидячий образ жизни — 1,2;</li>
          <li>Умеренная активность: легкие физические нагрузки, занятия 1-3 раза в неделю — 1,375;</li>
          <li>Средняя активность: занятия 3-5 раз в неделю — 1,55;</li>
          <li>Активные люди: интенсивные нагрузки, занятия 6-7 раз в неделю — 1,725;</li>
          <li>Спортсмены и люди, выполняющие сходные нагрузки: 6-7 раз в неделю — 1,9.</li>
        </ul>
        <p>Посчитайте свою норму калорий, умножив данные: BMR (базальный метаболизм) * AMR (активный метаболизм).</p>
        <h3>Формула Миффлина-Сан Жеора:</h3>
        <p>Одна из последних формул расчета калорий для оптимального похудения или сохранения нормального веса.
          Она была выведена в 2005 году группой американских врачей-диетологов под руководством докторов
          Миффлина и Сан Жеора и все чаще стала заменять классическую формулу Харриса-Бенедикта.</p>
        <p>Формула существует в двух вариантах — упрощенном и доработанном,
          и выдает необходимое количество килокалорий (ккал) в сутки для каждого конкретного человека.</p>
        <p><b>1. Упрощенный вариант формулы Миффлина-Сан Жеора:</b></p>
        <ul>
          <li>для мужчин: 10 х вес (кг) + 6,25 x рост (см) – 5 х возраст (г) + 5;</li>
          <li>для женщин: 10 x вес (кг) + 6,25 x рост (см) –5 x возраст (г) – 161.</li>
        </ul>
        <p><b>2. Доработанный вариант формулы Миффлина-Сан Жеора</b> дает более точную информацию
          и учитывает степень физической активности человека:</p>
        <ul>
          <li>для мужчин: (10 x вес (кг) + 6,25 x рост (см) – 5 x возраст (г) + 5) x A;</li>
          <li>для женщин: (10 x вес (кг) + 6,25 x рост (см) – 5 x возраст (г) – 161) x A.</li>
        </ul>
        <p>А — уровень активности человека, его различают по пяти степеням физических нагрузок в сутки:</p>
        <ul>
          <li>1,2 — сидячий образ жизни;</li>
          <li>1,375 — умеренная активность: легкие физические нагрузки, занятия 1-3 раза в неделю;</li>
          <li>1,55 — средняя активность: занятия 3-5 раз в неделю;</li>
          <li>1,725 — активные люди: интенсивные нагрузки, занятия 6-7 раз в неделю;</li>
          <li>1,9 — спортсмены и люди, выполняющие сходные нагрузки, например, те,
            кто занимается тяжелой атлетикой или другими силовыми видами спорта с ежедневными тренироваками,
            а также те, кто выполняет тяжелую физическую работу: 6-7 раз в неделю.</li>
        </ul>
      </div>
    </div>
  </div>
</template>

<style scoped>
.modal-window{
  padding: 20px 0 20px 20px;
  width: 500px;
}
</style>
